title: BCDEdit Failure Recovery Modification
submission_date: 2021/05/04
information_domain: Analytic
platforms:
- Windows
subtypes:
- Process
analytic_types:
- TTP
contributors:
- Splunk Threat Research <research@splunk.com>
id: analytics
description: This search looks for flags passed to bcdedit.exe modifications to the
  built-in Windows error recovery boot configurations. This is typically used by ransomware
  to prevent recovery.
coverage:
- technique: T1490
  tactics:
  - TA0040
  coverage: Moderate
implementations:
- description: You must be ingesting endpoint data that tracks process activity, including
    parent-child relationships from your endpoints to populate the Endpoint data model
    in the Processes node. Tune based on parent process names.
  code: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    as lastTime from datamodel=Endpoint.Processes where Processes.process_name = bcdedit.exe
    Processes.process="*recoveryenabled*" (Processes.process="* no*") by Processes.process_name
    Processes.process Processes.parent_process_name Processes.dest Processes.user
    | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
    | `bcdedit_failure_recovery_modification_filter`'
  type: Splunk
  data_model: Endpoint
unit_tests:
- configurations:
  - Using Splunk [Attack Range](https://github.com/splunk/attack_range)
  description: Replay the detection [dataset](https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1490/atomic_red_team/windows-sysmon.log)  using
    the Splunk attack range with the commands below
  commands:
  - python attack_range.py replay -dn data_dump [--dump NAME_OF_DUMP]
- configurations:
  - Using [Invoke-AtomicRedTeam](https://github.com/redcanaryco/invoke-atomicredteam)
  description: execute the atomic test [T1490](https://github.com/redcanaryco/atomic-red-team/tree/master/atomics/T1490)
    against a Windows target.
  commands:
  - Invoke-AtomicTest T1490
