title: Powershell Execution
submission_date: 2014/04/11
information_domain: Host
subtypes:
  - Process
analytic_types:
  - TTP
contributors:
  - MITRE
id: CAR-2014-04-003
description: |-
  [PowerShell](https://attack.mitre.org/techniques/T1086/) is a scripting environment included with Windows that is used by both attackers and administrators. Execution of PowerShell scripts in most Windows versions is opaque and not typically secured by antivirus which makes using PowerShell an easy way to circumvent security measures. This analytic detects execution of PowerShell scripts.

  Powershell can be used to hide monitored command line execution such as:
  -   `net use`
  -   `sc start`
coverage:
  - technique: T1086
    tactics:
      - TA0002
    coverage: High
  - technique: T1064
    tactics:
      - TA0005
    coverage: Moderate
implementations:
  - description: 'Look for versions of `PowerShell` that were not launched interactively.'
    code: |-
      process = search Process:Create
      powershell = filter process where (exe == "powershell.exe" AND parent_exe != "explorer.exe" )
      output powershell
    type: pseudocode
  - description: Splunk version of the above pseudocode.
    code: |-
      index=__your_sysmon_index__ EventCode=1 Image="C:\\Windows\\*\\powershell.exe" ParentImage!="C:\\Windows\\explorer.exe"|stats values(CommandLine) as "Command Lines" values(ParentImage) as "Parent Images" by ComputerName
    type: Splunk
    data_model: Sysmon native
  - description: EQL version of the above pseudocode.
    code: |-
      process where subtype.create and
        (process_name == "powershell.exe" and parent_process_name != "explorer.exe")    
    type: EQL
    data_model: EQL native
data_model_references:
  - process/create/exe
  - process/create/parent_exe
