---
title: Credential Dumping via Mimikatz
submission_date: 2019/04/29
information_domain: 'Host'
subtypes:
  - Process
analytic_types:
  - TTP
contributors:
  - MITRE
id: CAR-2019-04-004
description: |-
  Credential dumpers like Mimikatz can be loaded into memory and from there read data from another processes. This analytic looks for instances where processes are requesting specific permissions to read parts of the LSASS process in order to detect when credential dumping is occurring. One weakness is that all current implementations are “overtuned” to look for common access patterns used by Mimikatz.

  *This requires information about process access, e.g. Sysmon Event ID 10. That currently doesn’t have a CAR data model mapping, since we currently lack any open/access actions for Processes. If this changes, we will update the data model requirements.*
coverage:
  - technique: T1003
    tactics:
      - TA0006
    coverage: Low
implementations:
  - name: Common Mimikatz GrantedAccess Patterns
    description: This is specific to the way Mimikatz works currently, and thus is fragile to both future updates and non-default configurations of Mimikatz.
    code: |-
      index=__your_sysmon_data__ EventCode=10 
      TargetImage="C:\\WINDOWS\\system32\\lsass.exe"
      (GrantedAccess=0x1410 OR GrantedAccess=0x1010 OR GrantedAccess=0x1438 OR GrantedAccess=0x143a OR GrantedAccess=0x1418)
      CallTrace="C:\\windows\\SYSTEM32\\ntdll.dll+*|C:\\windows\\System32\\KERNELBASE.dll+20edd|UNKNOWN(*)" 
      | table _time hostname user SourceImage GrantedAccess
    type: splunk
    data_model: Sysmon native
  - name: Outliers
    description: This is an outlier version of the above without including the specific call trace. This should work in more (but not all) situations however runs more slowly and will have more false positives - typically installers.
    code: |-
      earliest=-d@d latest=now() index=__your_sysmon_data__
        EventCode=10
        TargetImage="C:\\WINDOWS\\system32\\lsass.exe"
        (GrantedAccess=0x1410 OR GrantedAccess=0x1010 OR GrantedAccess=0x1438 OR GrantedAccess=0x143a OR GrantedAccess=0x1418) 
      | search NOT [ search earliest=-7d@d latest=-2d@d index=__your_sysmon_data__ EventCode=10 TargetImage="C:\\WINDOWS\\system32\\lsass.exe" (GrantedAccess=0x1410 OR GrantedAccess=0x1010 OR GrantedAccess=0x1438 OR GrantedAccess=0x143a OR GrantedAccess=0x1418) 
        | dedup SourceImage 
        | fields SourceImage ]
      | table  _time hostname user SourceImage GrantedAccess
    type: splunk
    data_model: Sysmon native
references:
  - Credit to [Cyb3rWard0g](https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/blob/master/playbooks/windows/06_credential_access/credential_dumping_T1003/credentials_from_memory/mimikatz_logonpasswords.md), dim0x69 (blog.3or.de), and Mark Russinovich for providing much of the information used to construct these analytics.
true_positives:
  - source: 'Mordor (Sysmon)'
    description: 'Sysmon event from the Mordor [Interactive Task Manager lsass dump dataset](https://github.com/hunters-forge/mordor/blob/master/small_datasets/windows/credential_access/credential_dumping_T1003/interactive_taskmngr_lsass_dump.md). Note: the dumping is actually done by `taskmgr` in this case, though the data is still relevant.'
    event: |-
      '{"_index": "logs-endpoint-winevent-sysmon-2019.10.27",'
      '"_type": "_doc",'
      '"_id": "29110e17682dc9d2cf1ec61a77061c0c876d1d6b",'
      '"_score": 1,'
      '"_source": {'
      '    "process_guid": "a158f72c-2ef4-5db5-0000-00100fb48f00",'
      '    "user_reporter_domain": "NT AUTHORITY",'
      '    "process_target_id": "808",'
      '    "log": {'
      '    "level": "information"'
      '    },'
      '    "beat_version": "7.4.0",'
      '    "user_reporter_type": "User",'
      '    "log_name": "Microsoft-Windows-Sysmon/Operational",'
      '    "ecs": {'
      '    "version": "1.1.0"'
      '    },'
      '    "thread_id": "9380",'
      '    "record_number": 256899,'
      '    "log_ingest_timestamp": "2019-10-27T05:45:25.245Z",'
      '    "@version": "1",'
      '    "@event_date_creation": "2019-10-27T05:45:25.226Z",'
      '    "type": "wineventlog",'
      '    "level": "information",'
      '    "user_reporter_name": "SYSTEM",'
      '    "process_call_trace": "C:\\\\Windows\\\\SYSTEM32\\\\ntdll.dll+9c524|C:\\\\Windows\\\\System32\\\\KERNELBASE.dll+2730e|C:\\\\Windows\\\\system32\\\\taskmgr.exe+2e47e|C:\\\\Windows\\\\system32\\\\taskmgr.exe+7abcc|C:\\\\Windows\\\\system32\\\\taskmgr.exe+7b2e9|C:\\\\Windows\\\\system32\\\\taskmgr.exe+78653|C:\\\\Windows\\\\system32\\\\taskmgr.exe+7768e|C:\\\\Windows\\\\system32\\\\taskmgr.exe+38da8|C:\\\\Windows\\\\system32\\\\taskmgr.exe+3a14d|C:\\\\Windows\\\\System32\\\\KERNEL32.DLL+17944|C:\\\\Windows\\\\SYSTEM32\\\\ntdll.dll+6ce71",'
      '    "process_target_path": "c:\\\\windows\\\\system32\\\\lsass.exe",'
      '    "process_target_guid": "a158f72c-0aba-5db5-0000-00105d6c0000",'
      '    "version": 3,'
      '    "@timestamp": "2019-10-27T05:45:25.245Z",'
      '    "process_target_name": "lsass.exe",'
      '    "z_logstash_pipeline": ['
      '    "0098",'
      '    "fingerprint-winlogbeats7",'
      '    "winlogbeat_7-field_nest_cleanup",'
      '    "winlogbeat_7-copy_to_originals",'
      '    "1500",'
      '    "1521",'
      '    "1522",'
      '    "1523_7",'
      '    "1523_8",'
      '    "1524_9",'
      '    "1524_11",'
      '    "1524_13",'
      '    "1524_15",'
      '    "1531",'
      '    "1541_1",'
      '    "1541_3",'
      '    "process_granted_access_hex2dec",'
      '    "1544_2",'
      '    "1544_3",'
      '    "1544_5",'
      '    "1544_7",'
      '    "winevent-hostname-cleanup",'
      '    "winevent-user_reporter_name-is-machine-account",'
      '    "copy-8802-001",'
      '    "copy-8802-002"'
      '    ],'
      '    "opcode": "Info",'
      '    "task": "Process accessed (rule: ProcessAccess)",'
      '    "agent": {'
      '    "type": "winlogbeat",'
      '    "ephemeral_id": "81582c0c-9ac2-4a94-ad39-6e6f4ce9d096",'
      '    "hostname": "WECServer",'
      '    "id": "72887cd5-18d3-415c-ada9-cfb237f9309f",'
      '    "version": "7.4.0"'
      '    },'
      '    "source_name": "Microsoft-Windows-Sysmon",'
      '    "process_id": "2408",'
      '    "provider_guid": "5770385f-c22a-43e0-bf4c-06f5698ffbd9",'
      '    "event_id": 10,'
      '    "meta_user_reporter_name_is_machine": "false",'
      '    "action": "processaccess",'
      '    "process_name": "taskmgr.exe",'
      '    "beat_hostname": "WECServer",'
      '    "event": {'
      '    "created": "2019-10-27T05:45:27.328Z",'
      '    "code": 10,'
      '    "action": "Process accessed (rule: ProcessAccess)",'
      '    "kind": "event"'
      '    },'
      '    "process_path": "c:\\\\windows\\\\system32\\\\taskmgr.exe",'
      '    "user_reporter_sid": "S-1-5-18",'
      '    "process_granted_access": 5136,'
      '    "z_original_message": "Process accessed:\\nRuleName: \\nUtcTime: 2019-10-27 05:45:25.226\\nSourceProcessGUID: {a158f72c-2ef4-5db5-0000-00100fb48f00}\\nSourceProcessId: 2408\\nSourceThreadId: 9380\\nSourceImage: C:\\\\Windows\\\\system32\\\\taskmgr.exe\\nTargetProcessGUID: {a158f72c-0aba-5db5-0000-00105d6c0000}\\nTargetProcessId: 808\\nTargetImage: C:\\\\Windows\\\\system32\\\\lsass.exe\\nGrantedAccess: 0x1410\\nCallTrace: C:\\\\Windows\\\\SYSTEM32\\\\ntdll.dll+9c524|C:\\\\Windows\\\\System32\\\\KERNELBASE.dll+2730e|C:\\\\Windows\\\\system32\\\\taskmgr.exe+2e47e|C:\\\\Windows\\\\system32\\\\taskmgr.exe+7abcc|C:\\\\Windows\\\\system32\\\\taskmgr.exe+7b2e9|C:\\\\Windows\\\\system32\\\\taskmgr.exe+78653|C:\\\\Windows\\\\system32\\\\taskmgr.exe+7768e|C:\\\\Windows\\\\system32\\\\taskmgr.exe+38da8|C:\\\\Windows\\\\system32\\\\taskmgr.exe+3a14d|C:\\\\Windows\\\\System32\\\\KERNEL32.DLL+17944|C:\\\\Windows\\\\SYSTEM32\\\\ntdll.dll+6ce71",'
      '    "winlog": {'
      '    "api": "wineventlog",'
      '    "opcode": "Info",'
      '    "task": "Process accessed (rule: ProcessAccess)",'
      '    "computer_name": "it001.shire.com",'
      '    "provider_guid": "{5770385f-c22a-43e0-bf4c-06f5698ffbd9}",'
      '    "process": {'
      '        "thread": {'
      '        "id": 3760'
      '        },'
      '        "pid": 3168'
      '    },'
      '    "channel": "Microsoft-Windows-Sysmon/Operational",'
      '    "event_id": 10,'
      '    "record_id": 256899,'
      '    "provider_name": "Microsoft-Windows-Sysmon",'
      '    "version": 3'
      '    },'
      '    "user": {},'
      '    "host_name": "it001.shire.com"'
      '},'
      '"fields": {'
      '    "@timestamp": ['
      '    "2019-10-27T05:45:25.245Z"'
      '    ],'
      '    "@event_date_creation": ['
      '    "2019-10-27T05:45:25.226Z"'
      '    ],'
      '    "log_ingest_timestamp": ['
      '    "2019-10-27T05:45:25.245Z"'
      '    ]'
      '    }'
      '}'
